app/views/admin/items/new.html.erb

          <h4><%= f.label :ジャンル ,class: "col-xs-3 fix" %>
          <%= f.collection_select :genre_id, Genre.all, :id, :name %></h4>
---
SELECT "genres".* FROM "genres"