app/controllers/admin/customers_controller.rb

  def edit
  	@customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def update
  	@customer = Customer.find(params[:id])
  	if @customer.update(customer_params)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "customers" SET "is_active" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_active", 1], ["updated_at", "2021-09-09 08:49:02.125828"], ["id", 4]]