app/controllers/admin/genres_controller.rb

INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "a"], ["created_at", "2021-09-06 12:44:29.325956"], ["updated_at", "2021-09-06 12:44:29.325956"]]
---
  def create
    @genre = Genre.new(genre_params)
    @genre.save