app/controllers/admin/homes_controller.rb

  def top
  	@orders = Order.all
---
SELECT "orders".* FROM "orders"