app/controllers/admin/items_controller.rb

INSERT INTO "items" ("genre_id", "name", "image_id", "introduction", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
  	@item = Item.new(item_params)
  	if @item.save