app/views/admin/homes/top.html.erb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
		        <td class="text-left">
		         <%= order.customer.first_name %> <%= order.customer.last_name %>

SELECT "orders".* FROM "orders"
SELECT COUNT(*) FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]
---
		        <td class="text-right">
		          <%= order.order_details.count %>