app/controllers/public/cart_items_controller.rb

  def create
	if current_customer.cart_items.count >= 1
	  if nil != current_customer.cart_items.find_by(item_id: params[:cart_item][:item_id])
		   @cart_item_u = current_customer.cart_items.find_by(item_id: params[:cart_item][:item_id])
		   @cart_item_u.amount += params[:cart_item][:amount].to_i
		   @cart_item_u.update(amount: @cart_item_u.amount) #
		   redirect_to cart_items_path
		 else
			 	@cart_item = CartItem.new(cart_item_params)
			@cart_item.customer_id = current_customer.id
			if @cart_item.save
				 redirect_to cart_items_path
			else
				@items = Item.all
		    @quantity = Item.count
		    @genres = Genre.all
				render 'index'
		end
  end

	else
		@cart_item = CartItem.new(cart_item_params)
		@cart_item.customer_id = current_customer.id
		if @cart_item.save
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ? AND "cart_items"."item_id" = ? LIMIT ?  [["customer_id", 5], ["item_id", 4], ["LIMIT", 1]]
SELECT COUNT(*) FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 5]]
INSERT INTO "cart_items" ("customer_id", "item_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["customer_id", 5], ["item_id", 4], ["amount", 2], ["created_at", "2021-09-09 11:39:23.159757"], ["updated_at", "2021-09-09 11:39:23.159757"]]
INSERT INTO "cart_items" ("customer_id", "item_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["customer_id", 5], ["item_id", 2], ["amount", 1], ["created_at", "2021-09-09 11:38:51.863551"], ["updated_at", "2021-09-09 11:38:51.863551"]]

	def update
		@cart_item = CartItem.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

	def destroy
		@cart_item = CartItem.find(params[:id])
		@cart_item.destroy
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 1]]