app/controllers/public/customers_controller.rb

  def destroy

    current_customer.update(is_active: false)
---
UPDATE "customers" SET "is_active" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_active", nil], ["updated_at", "2021-09-09 08:16:15.407395"], ["id", 3]]