app/controllers/public/homes_controller.rb

  def top
    @genres = Genre.all
    @items = Item.all
---
SELECT "items".* FROM "items"