app/controllers/public/items_controller.rb

    def index
    @items = Item.all
    @quantity = Item.count
---
SELECT "items".* FROM "items"
SELECT COUNT(*) FROM "items"