app/views/public/orders/new.html.erb

SELECT "addresses".* FROM "addresses" WHERE "addresses"."customer_id" = ?  [["customer_id", 5]]
---
        <label style="margin-left: 60px;"><%= f.radio_button :address_number,1,checked: "checked" %> ご自身の住所 </label><br>
        <div style="margin-left:70px;"><%= current_customer.postal_code %> <%= current_customer.address %><br><%= current_customer.last_name %><%= current_customer.first_name %></div><br><br>

SELECT "addresses".* FROM "addresses" WHERE "addresses"."customer_id" = ?  [["customer_id", 5]]
---
          <label style="margin-left: 60px;"><%= f.radio_button :address_number ,2%> 登録済からの選択</label><br>
          <div style="margin-left:80px; padding:0 100px;"><%= f.collection_select(:address_id, current_customer.addresses.all, :id, :address_all)%><br><br>